[
    {
        "client_msg_id": "d384fd54-e766-4b50-bf74-9341819daf0b",
        "type": "message",
        "text": "<https:\/\/norabateson.wordpress.com\/2015\/11\/03\/symmathesy-a-word-in-progress\/>",
        "user": "U0A48EDPD",
        "ts": "1537121629.000100",
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "VjG",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "link",
                                "url": "https:\/\/norabateson.wordpress.com\/2015\/11\/03\/symmathesy-a-word-in-progress\/"
                            }
                        ]
                    }
                ]
            }
        ],
        "team": "T0A48J0MV",
        "user_team": "T0A48J0MV",
        "source_team": "T0A48J0MV",
        "user_profile": {
            "avatar_hash": "0afdabdefe98",
            "image_72": "https:\/\/avatars.slack-edge.com\/2017-05-06\/179039830384_0afdabdefe98471fc0ae_72.png",
            "first_name": "",
            "real_name": "faby",
            "display_name": "",
            "team": "T0A48J0MV",
            "name": "faby",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "attachments": [
            {
                "service_name": "norabateson",
                "service_url": "http:\/\/norabateson.wordpress.com",
                "title": "Symmathesy: A Word in Progress",
                "title_link": "https:\/\/norabateson.wordpress.com\/2015\/11\/03\/symmathesy-a-word-in-progress\/",
                "author_name": "Nora Bateson",
                "author_link": "https:\/\/norabateson.wordpress.com\/author\/norabateson\/",
                "thumb_url": "https:\/\/norabateson.files.wordpress.com\/2015\/11\/dsc_0572.jpg?w=1200&fit=200%2C150",
                "thumb_width": 200,
                "thumb_height": 113,
                "text": "This is a big blog post, ( 25 pages). This paper was presented at the International Society for Systems Sciences Conference in Berlin August 2015. It will be published in the ISSS Journal as well. The following pages are a beginning of a concept and terminology that I have found useful in my own work to describe the learning within&nbsp;shifting&nbsp;interactions and patterns through time. There are many chapters to come. The next chapter is on mutual learning contexts that&nbsp;are comprised of&nbsp;living and non-living systems.I hope it will be useful for you as well. &nbsp;Enjoy&hellip;\nProposing a New Word that Refers to Mutual Learning in Living Systems:\nSymmathesy\n&ndash; copyright Nora Bateson 2015&ndash;\n\nPrologue:\nPart I\nThe Word &ldquo;Symmathesy&rdquo; On The Page\nProposition:\nI would like to propose a new word for &ldquo;System&rdquo; that refers specifically to&nbsp;living systems &ndash; that is, to systems which emerge from the communications and interactions of living vitae (another new term, one which will be defined later). The new word, and concept, for &ldquo;system&rdquo; that I propose is one which highlights the expression and communication of interdependency and, particularly, mutual learning. The existing word, &ldquo;system&rdquo;, while useful for discussion of many kinds of systems, does not communicate contextual fields of simultaneous learning as is necessary for life. The inclusion of mutual learning in the terminology is specifically meant to preclude the models of engineering and mechanism that are implicit in much systems theorizing today.&nbsp;&nbsp; We have learned that when dealing with living systems, the many variables of developing interaction become untenable to consider in such mechanistic parameters. This change in concept should spark a significant shift in our work, in the sciences, applied professions, communication, arts, that addresses or depends upon our understanding of life and evolution. The discourse with which we discuss and study the living world should be representative of the living world, and should cautiously avoid connotations that imply or are derived from engineering.\nThe notion of systems as being an arrangement of parts and wholes has become a distraction from the new systemic vision, which we are trying to encourage, that sees life as relational mutual learning contexts. As studies ranging from cognitive science to epigenetics, social science, ecology and evolutionary theory, are increasingly showing, evolution emerges in interrelationality, not in arrangement. Therefore the need is acute to create a&nbsp;differentiation between living systems and other systems.\nBiology, culture, and society are dependent at all levels upon the vitality of interaction they produce both internally and externally. A body, a family, a forest or a city can each be described as a buzzing hive of communication between and within its vitae. Together the organs of your body allow you to make sense of the world around you. A jungle can be understood best as a conversation among its flora and fauna, including the insects, the fungi of decay, and contact with humanity. Interaction is what creates and vitalizes the integrity of the living world. Over time the ongoing survival of the organisms in their environments requires that there be learning, and learning to learn, together. Gregory Bateson said, &ldquo;The evolution is in the context.&rdquo; So why don&rsquo;t we have a word for mutual learning in living contexts?\nI want to put the Greek prefix Syn\/ Sym (together) + Mathesi, (to learn):\nSymmathesy = Learning together.\n(Pronounced: sym- math-a-see)\n&nbsp;A working definition of symmathesy might look like this:\nSymmathesy (Noun): An entity composed by contextual mutual learning through interaction. This process of interaction and mutual learning takes place in living entities at larger or smaller scales of symmathesy.\nSymmathesy (Verb): to interact within multiple variables to produce a mutual learning context.\n\nInterdependency is vital to the health of any system.  But, the interdependency does not sit still. All of biological evolution, and development of culture and society, would seem to be a testament to the characteristics of contextual multilayered shiftings through time. Nothing stays the same, clearly. So could it be that change is a kind of learning? If a living entity transforms, even slightly, some of its contextual interrelationships, it is within that shift that a calibration change is revealed. The same kind of tree in the same forest does not necessarily grow to be the same shape. One may have higher winds to contend with, or grow with a thicker density of flora around it. The trees in these contrasting contexts live into their contexts by receiving the many forms of relational information they are within, and responding to them. Thus they grow to be different shapes, to metabolize at different levels and so on.\nOur conceptual understanding of the living world can be elevated with a new terminology that better describes the processes we are referring to within it. The viability of this new term is a step toward a clearer understanding of the way we describe the difference between what we can &ldquo;control&rdquo;, i.e. in material terms, and that which requires another approach, i.e. interacting with the complexity of evolving living systems.\nWhat is the difference between learning and life? None.\n&nbsp;When is something living NOT learning? Never.\n&nbsp;The concept I have begun to seed in the following pages is my attempt to provide what I hope will be a useful fusion of ideas. I invite the reader to recognize its combined sources in systems theory, (including complexity theory and developmental systems theory), as well as the theory of MIND, presented by Gregory Bateson in his book Mind and Nature. While both of these bodies of work have provided the roots of our work today in developing new forms of research for the International Bateson Institute, I have found that within those vocabularies I habitually need to clarify the terms, so as to incorporate the transcontextual and ever changing variables of life. This has become a task that invariably accompanies our studies of complex life. The explanation needed to differentiate the characteristics of a living system from a mechanical system seems to necessitate a repeated listing of the processes of interrelationship that currently must be tagged onto every discussion. Equally distracting is the explanation needed to differentiate between Gregory Bateson&rsquo;s ideas of MIND as life, from a related contemporary idea which it is connected to, but not reducible to,&ndash;&ldquo;neuro-cognition&rdquo;. While for me MIND is much closer to being a usable concept, the tendency in our culture to confuse &lsquo;mind&rsquo; with &lsquo;brain&rsquo; creates for many people a rabbit hole of misunderstandings around the notion of immanent MIND. This tension between the concepts Bateson developed and called MIND, and systems theory, has provided a base from which I have begun to play with the idea of mutual learning as the basis of life.\nMutual Learning Contexts:\nThe International Bateson Institute was founded in 2014 with the mission of developing a process of inquiry that would begin to take into account the many contexts that any particular field of study exists within. It is difficult if not impossible to find a subject to study in the living world that is definable within a single context. Transcontextual research offers multiple descriptions of the way in which a &lsquo;subject&rsquo; is nested in many contexts. This information provides descriptions of interactions that seem to erase the boundaries of what we might have previously considered to be parts and wholes. Medicine is entwined in culture, food, environmental conditions, education, economic stability, and more. Economy is formed through culture, transportation, resources, communication and …",
                "fallback": "norabateson Link: Symmathesy: A Word in&nbsp;Progress",
                "from_url": "https:\/\/norabateson.wordpress.com\/2015\/11\/03\/symmathesy-a-word-in-progress\/",
                "service_icon": "https:\/\/s2.wp.com\/i\/webclip.png",
                "id": 1,
                "original_url": "https:\/\/norabateson.wordpress.com\/2015\/11\/03\/symmathesy-a-word-in-progress\/"
            }
        ]
    }
]