[
    {
        "type": "message",
        "text": "Théorisation des rôles en combat en fonction du moment du combat. Qu'en pensez-vous ?",
        "files": [
            {
                "id": "FPNER6DUY",
                "created": 1571753917,
                "timestamp": 1571758844,
                "name": "Roles_en_combat_-_Temporalite",
                "title": "Rôles en combat - Temporalité",
                "mimetype": "application\/vnd.slack-docs",
                "filetype": "docs",
                "pretty_type": "Arugula",
                "user": "U0DTHMU81",
                "user_team": "T0A48J0MV",
                "editable": true,
                "size": 5308,
                "mode": "docs",
                "is_external": false,
                "external_type": "",
                "is_public": true,
                "public_url_shared": false,
                "display_as_bot": false,
                "username": "",
                "url_private": "https:\/\/files.slack.com\/files-pri\/T0A48J0MV-FPNER6DUY\/Roles_en_combat_-_Temporalite?t=xoxe-10144612743-5648014094567-5665001837620-2c38b9d1d30d89a7388af1bb975e1737",
                "url_private_download": "https:\/\/files.slack.com\/files-pri\/T0A48J0MV-FPNER6DUY\/download\/Roles_en_combat_-_Temporalite?t=xoxe-10144612743-5648014094567-5665001837620-2c38b9d1d30d89a7388af1bb975e1737",
                "permalink": "https:\/\/de-dale.slack.com\/files\/T0A48J0MV\/FPNER6DUY",
                "permalink_public": "https:\/\/slack-files.com\/T0A48J0MV-FPNER6DUY-1c71fb0620",
                "preview": "<p>Il existe 3 rôles que peuvent prendre les classes pendant un combat en fonction du moment du combat :<\/p><ul><li>Opener \/ Ouvreur :<\/li><\/ul><p>Premiers rounds du combat<br>L'objectif de ce rôle est d'utiliser le plus rapidement possible ses capacités les plus puissantes pour obtenir un avantage le plus tôt possible. Cela peut être du contrôle des foules ou de sortir du combat une cible prioritaire dont la perte nuiera aux ennemis.<br>Les personnages prenant ce rôle ont généralement des classes avec des ressources limitées mais disponibles immédiatement. On peut y trouver :<\/p><ul><li>L'assassin : Il dispose de toutes ses astuces après un repos court. Cela lui permet d'en consommer pour essayer de se défaire d'une cible prioritaire.<\/li><li>L'érudit : Il dispose de tous ses sorts les plus puissants après un repos long.<\/li><li>Le lieur : Il recharge toute sa Mana après un repos court, lui donnant un fort potentiel d'ouverture.<\/li><li>Le moine : Il peut faire un Ouvreur correct avec un peu de Prana et en utilisant son Equilibre au maximum pour faire un maximum de disruption chez les ennemis. Cette stratégie lui coûtera potentiellement cher sur les tours suivants car il risque de se retrouver au sol et entouré d'ennemis.<\/li><\/ul><p><br><\/p><ul><li>Sustainer \/ Mainteneur :<\/li><\/ul><p>Tout le combat<br>L'objectif de ce rôle est de maintenir une pression constante sur les ennemis en dépensant le moins de ressources possible, pour garder un avantage acquis ou le prendre peu à peu.<br>Les personnages prenant ce rôle ont généralement des classes aux ressources illimitées. On peut y trouver :<\/p><ul><li>L'enragé : Il devient peu à peu plus efficace grâce à la progression de son Adrénaline pendant le combat. Avec beaucoup de Maîtrise, il génère suffisamment d'Adrénaline pour se permettre d'en consommer régulièrement afin de créer de petites pressions.<\/li><li>Le fanatique : Il dispose de capacités utilisables à l'infinie qui sont un peu faibles, mais lui permettent d'avoir une présence. Il peut aussi choisir d'utiliser son Incarnation régulièrement pour prendre l'avantage.<\/li><li>Le moine : Son Equilibre est infini, mais implique d'avoir des tours forts où il perd de l'Equilibre et des tours faibles où il en récupère.<\/li><\/ul><p><br><\/p><ul><li>Finisher \/ Finisseur :<\/li><\/ul><p>Derniers rounds du combat<br>L'objectif de ce rôle est de clôturer un combat le plus vite possible lorsqu'il a commencé et que l'occasion se présente de faire particulièrement mal à l'ennemi. Cela peut être en éliminant brutalement une cible résistante qui était la clef de voûte de la stratégie ennemie ou en bénéficiant d'une configuration spécifique pour faire un maximum de dégâts.<br>Les personnages prenant ce rôle peuvent être des ouvreurs conservant leurs ressources ou bien des classes pouvant cumuler des ressources et les dépenser en une seule fois pour bénéficier d'un effet particulièrement puissant. On peut y trouver :<\/p><ul><li>L'enragé : Il peut dépenser toute son Adrénaline pour faire des attaques dévastatrices au prix de son efficacité sur les tours suivants.<\/li><li>Le fanatique : Avec beaucoup de Maîtrise, son Incarnation peut devenir une arme très puissante pendant quelques rounds.<\/li><li>Le barde : Après une longue harmonie, un puissant final peut avoir un impact significatif.<\/li><\/ul><p><br>Le rôle de chaque personnage peut aussi évoluer au fur et à mesure que la journée avance. Ainsi, un fanatique ou un moine ayant réussi à cumuler beaucoup de ressources au fur et à mesure peuvent devenir d'excellents Ouvreurs sur les derniers combats en dépensant dès le début leurs ressources.<br><br>Chaque rôle a son importance propre. Un groupe dans lequel il manque un rôle risque de rencontrer des difficultés :<\/p><ul><li>Pas d'Ouvreur : Le groupe ne pourra pas prendre d'avantage au début du combat, voire risque de subir l'Ouvreur adverse, le mettant derrière tout le combat, jusqu'à ce qu'il le clôture. La meilleure parade est d'avoir de solides Mainteneurs qui peuvent rattraper le retard pris et des Finisseurs pouvant prendre le rôle de l'Ouvreur sur les combats les plus complexes.<\/li><li>Pas de Mainteneur : Le groupe ne pourra pas tenir de longs combats. Son objectif sera de clôturer un combat le plus vite possible et de bénéficier d'une ouverture la plus avantageuse possible pour garder l'avantage jusqu'à ce que les Finisseurs ne clôturent.  Les combats seront donc particulièrement violents. L'élimination des cibles prioritaires est la meilleure option.<\/li><li>Pas de Finisseur : C'est la moins pire des combinaisons, mais cela signifie que les combats dureront longtemps, augmentant les dégâts subis. De plus, lorsque les Finisseurs adverses passeront à l'action, le risque de perdre l'avantage deviendra important. Le meilleur moyen d'éviter cela est de prioriser les Finisseurs adverses pour forcer l'ennemi à se retrouver dans la même situation. De plus, il est possible de compenser le manque de burst par le ciblage d'une cible en particulier pour l’éliminer au plus tôt.<\/li><\/ul><p><br><\/p>",
                "editor": null,
                "last_editor": "U0DTHMU81",
                "non_owner_editable": false,
                "updated": 1571758844,
                "is_starred": false,
                "has_rich_preview": false,
                "file_access": "visible"
            }
        ],
        "upload": false,
        "user": "U0DTHMU81",
        "display_as_bot": false,
        "ts": "1571758900.000100",
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "pS4aS",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "text",
                                "text": "Théorisation des rôles en combat en fonction du moment du combat. Qu'en pensez-vous ?"
                            }
                        ]
                    }
                ]
            }
        ]
    }
]