[
    {
        "type": "message",
        "text": "1° partie d'un long doc sur les types de rencontre en fonction du nombre d'individu. Je commence par le Mono, un seul monstre puissant. A noter que cela s'applique aux boss et aux trash.",
        "files": [
            {
                "id": "FPT6RMYTF",
                "created": 1572008320,
                "timestamp": 1572008348,
                "name": "Mono",
                "title": "Mono",
                "mimetype": "application\/vnd.slack-docs",
                "filetype": "docs",
                "pretty_type": "Arugula",
                "user": "U0DTHMU81",
                "user_team": "T0A48J0MV",
                "editable": true,
                "size": 3276,
                "mode": "docs",
                "is_external": false,
                "external_type": "",
                "is_public": true,
                "public_url_shared": false,
                "display_as_bot": false,
                "username": "",
                "url_private": "https:\/\/files.slack.com\/files-pri\/T0A48J0MV-FPT6RMYTF\/Mono?t=xoxe-10144612743-5648014094567-5665001837620-2c38b9d1d30d89a7388af1bb975e1737",
                "url_private_download": "https:\/\/files.slack.com\/files-pri\/T0A48J0MV-FPT6RMYTF\/download\/Mono?t=xoxe-10144612743-5648014094567-5665001837620-2c38b9d1d30d89a7388af1bb975e1737",
                "permalink": "https:\/\/de-dale.slack.com\/files\/T0A48J0MV\/FPT6RMYTF",
                "permalink_public": "https:\/\/slack-files.com\/T0A48J0MV-FPT6RMYTF-6a589fe8e7",
                "preview": "<p>Une structure Mono implique un individu unique qui représente plus de 90% du combat. Il est donc possible d’avoir une seule créature ou une créature principale accompagnée de quelques alliés ou minions très faibles. Cette structure est très commune pour les boss.<br>Les caractéristiques d’un Mono sont les suivantes :<br>-       Une force principale dont il se sert autant que possible<br>-       2 à 3 forces secondaires sur lesquelles il se replie si la principale n’est plus utilisable ou appropriée<br>-       Une stratégie de défense préférée<br>-       Des défenses secondaires qui viennent compenser ses principales faiblesses<br>-       Des moyens de contrebalancer l’infériorité numérique lorsque c’est le cas<br>Atteindre de telles spécificités signifie que le Mono investit la majorité de ses ressources dans ses forces et défenses secondaires et assez peu dans ses principales. Il est possible de choisir d’investir un maximum de ressources dans les forces et défenses principales du Mono, pour créer un adversaire particulièrement puissant dans sa spécialisation mais volontairement faible autrement. Le risque associé à ce type d’ennemi est la vitesse à laquelle les joueurs exploitent sa faiblesse, faisant varier la difficulté de très simple à très coûteux en ressources.<br>Un Mono doit au moins couvrir le rôle de Mainteneur et de Marteau, sinon il risque de ne pas être suffisamment dangereux pendant la durée du combat. Il peut avoir d’autres rôles secondaires pour compenser ses faiblesses (par exemple Enclume pour gérer l’infériorité numérique ou Bras pour améliorer ses faiblesses).<br><u>Combat<\/u><br>Dans le cadre de combat, cela signifie que le Mono doit posséder 2 ou 3 options d’attaque différentes de sa principale et de renforcer faiblesses parmi CA \/ JS \/ Mobilité \/ Résistance \/ PV. L’infériorité numérique peut être contrée par des actions supplémentaires ou des effets faisant perdre des actions aux personnages (soit en perte directe soit en les forçant à accomplir des actions ne participant pas directement à le vaincre).<br><em>Exemple : Combattant seul dans une caverne avec une arme à 2 mains en armure lourde et une excellente CAR.<\/em><br><em>Ce Mono dispose d’une arme à 2 mains comme force principale. Tant qu’il peut, il cherchera à frapper avec pour infliger un maximum de dégâts et sa forte CAR lui garantit une bonne chance de toucher avec. Son risque principal est de perdre son arme ou de ne pas pouvoir atteindre ses ennemis au corps à corps. Pour compenser cela, il prend une épée longue en arme secondaire et un arc qui sera mieux qui rien s’il se retrouve bloqué à distance.<\/em><br><em>En terme de défenses, ses PV, CA et Vigueur sont très bon. Ses Réflexes et sa Volonté laissent à désirer et son armure lourde réduit sa mobilité. Il va donc chercher à les améliorer en priorité pour éviter de se faire contrôler dès le début du combat.<\/em><br><em>Enfin, il doit compenser le fait qu’il soit seul. Pour cela, il peut créer un éboulement dans la caverne qui forcera les personnages à se déplacer, avoir une chance de faire perdre des actions au personnage qu’il touche, ou encore frapper plusieurs personnages à la fois pour les forcer à changer leur positionnement.<\/em><br><\/p>",
                "editor": null,
                "last_editor": "U0DTHMU81",
                "non_owner_editable": false,
                "updated": 1572008348,
                "is_starred": false,
                "has_rich_preview": false,
                "file_access": "visible"
            }
        ],
        "upload": false,
        "user": "U0DTHMU81",
        "display_as_bot": false,
        "ts": "1572008458.000700",
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "7HKR",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "text",
                                "text": "1° partie d'un long doc sur les types de rencontre en fonction du nombre d'individu. Je commence par le Mono, un seul monstre puissant. A noter que cela s'applique aux boss et aux trash."
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "type": "message",
        "text": "2° partie avec une équipe de 2.",
        "files": [
            {
                "id": "FPVCTP4RL",
                "created": 1572008471,
                "timestamp": 1572008491,
                "name": "Duo",
                "title": "Duo",
                "mimetype": "application\/vnd.slack-docs",
                "filetype": "docs",
                "pretty_type": "Arugula",
                "user": "U0DTHMU81",
                "user_team": "T0A48J0MV",
                "editable": true,
                "size": 5624,
                "mode": "docs",
                "is_external": false,
                "external_type": "",
                "is_public": true,
                "public_url_shared": false,
                "display_as_bot": false,
                "username": "",
                "url_private": "https:\/\/files.slack.com\/files-pri\/T0A48J0MV-FPVCTP4RL\/Duo?t=xoxe-10144612743-5648014094567-5665001837620-2c38b9d1d30d89a7388af1bb975e1737",
                "url_private_download": "https:\/\/files.slack.com\/files-pri\/T0A48J0MV-FPVCTP4RL\/download\/Duo?t=xoxe-10144612743-5648014094567-5665001837620-2c38b9d1d30d89a7388af1bb975e1737",
                "permalink": "https:\/\/de-dale.slack.com\/files\/T0A48J0MV\/FPVCTP4RL",
                "permalink_public": "https:\/\/slack-files.com\/T0A48J0MV-FPVCTP4RL-7dffcda448",
                "preview": "<p>Une structure Duo est composée de 2 individus distincts qui représentent à eux 2 plus de 90% du combat. Elle est intéressante lorsque les membres du Duo peuvent avoir des synergies entre eux qui les rendent bien plus efficaces que seuls. Elle peut prendre plusieurs formes en fonction des rôles et de la répartition de la puissance.<br>-       <strong>Rôles <\/strong>:<br>·       <u>Redondants <\/u>:<br>Les 2 individus ont exactement les mêmes forces et faiblesses. Cela multiplie la dangerosité de leurs forces, mais accroit leur sensibilité à leurs faiblesses. Cela peut être intéressant à mettre en place lorsque les forces du Duo gagnent en puissance à être dédoublées, comme par exemple des techniques de combat spécifiques.<br>·       <u>Complémentaires<\/u> :<br>Les 2 individus ont des pouvoirs différents, ce qui change leurs forces et leurs faiblesses. Cette composition est plus stable que lorsque les rôles sont redondants, mais moins explosive. Le principal avantage de ce type de Duo est de permettre à chaque membre de couvrir les faiblesses de l’autre et donc de construire des individus plus spécialisés.<br>-       <strong>Puissance<\/strong> :<br>·       <u>Similaire <\/u>:<br>Les 2 individus ont une puissance proche, ce qui signifie que chacun d’entre eux représente en 40% et 50% du combat. Cette répartition assure qu’au moins la moitié du combat se passera avec le Duo entier en vie, mais limite la puissance de chacun et rend la mort d’un des deux membres importante car la puissance du Duo diminue d’au moins 50% (plus les synergies).<br>·       <u>Disproportionnée <\/u>:<br>Les 2 individus ont un écart de puissance significatif, ce qui en rend un bien plus puissant que l’autre. Le membre le plus puissant (le majeur) ne doit pas dépasser le triple de la puissance du plus faible (le mineur) (donc 75% – 25%). Cette composition permet de créer un individu puissant, non loin d’un Mono, mais nécessitant moins d’investissement dans ses caractéristiques secondaires, celles-ci pouvant être couvertes par l’individu le plus faible. Elle offre aussi un dilemme aux personnages : tuer rapidement le membre le plus faible et garder le plus puissant pour la fin au risque qu’il ait profité de ce temps pour devenir plus dangereux ou cibler le plus puissant en priorité pour quasiment clôturer le combat lors de sa défaite mais accepter de passer la majorité du combat en face d’un Duo complet.<br>Les membres d’un Duo sont plus libres dans la composition des rôles qu’un Mono. Il doit y avoir au moins un Mainteneur et au moins un Marteau dans un Duo. Certaines combinaisons sont très classiques, mais il est possible de créer celles que l’on veut en fonction de la situation :<br>-       <strong>Frères d’arme<\/strong> : Double Marteau Mainteneur– Redondants – Similaire<br>Ce Duo est basé sur 2 individus aux techniques de combat d’équipe. Ils exploitent le fait de posséder des capacités identiques à forte synergie pour se focaliser sur une cible et l’abattre.<br>-       <strong>Chevalier et écuyer<\/strong> : Double Marteau Mainteneur– Redondants – Disproportionnée<br>Ce Duo fonctionne comme les Frères d’arme, à la différence qu’il agit comme un Mono avec un allié solide pour lui permettre d’exécuter des synergies plus puissantes. Cette combinaison rend l’efficacité de cette structure très liée à la vitesse à laquelle le mineur se fait sortir de combat et à la dépendance du majeur aux synergies employées.<br>-       <strong>Support offensif<\/strong> : Marteau Mainteneur majeur + Enclume Ouvreur\/Mainteneur – Complémentaire – Disproportionnée<br>Contrairement au Chevalier et écuyer, l’objectif de ce Duo est de laisser l’Enclume mineur prendre l’avantage pour laisser le Marteau s’exprimer. Si l’Enclume est Ouvreur, ce Duo est très simple à exécuter et très explosif : Prise d’avantage au début puis capitalisation par le Marteau. La mort de l’Enclume, passé les premiers tours, n’est pas très grave, il vaut donc mieux s’occuper du Marteau. Si l’Enclume est Mainteneur par contre, l’objectif du Duo est de la maintenir en vie et celui des personnages est de la tuer au plus vite.<br>-       <strong>Support défensif<\/strong> : Marteau Mainteneur majeur + Bras Ouvreur\/Mainteneur – Complémentaire – Disproportionnée<br>Composition assez proche du Support offensif à la différence qu’un Bras Ouvreur à la possibilité de se sacrifier passé les 1° tour pour laisser un maximum de temps au Marteau et qu’un Bras Mainteneur aura plus de facilité à se protéger de ses adversaires.<br>-       <strong>Garde du corps<\/strong> : Marteau Mainteneur (mineur) + Enclume Finisseur (majeur) – Complémentaire – Similaire (Disproportionnée)<br>L’objectif de ce Duo est d’avoir un Marteau le plus menaçant possible pour focaliser les coups sur lui et laisser à l’Enclume le temps de monter en puissance pour clore le combat. Il est possible de l’avoir en Disproportionnée pour augmenter la puissance de l’Enclume au risque de voir le Marteau mourir trop vite.<br>-       <strong>Brutalité<\/strong> : Marteau Finisseur (majeur) + Bras Mainteneur (mineur) – Complémentaire – Similaire (Disproportionnée)<br>Ce Duo cherche à transformer le Marteau en machine de guerre grâce au Bras puis le laisser clôturer le combat violemment. Il est possible de l’avoir en Disproportionnée aussi, comme pour le Garde du corps, pour augmenter cette sensation de puissance finale. Si la différence de puissance entre le Bras et le Marteau devient vraiment importante, le Bras peut devenir un Ouvreur qui cherche à se sacrifier ensuite pour faire gagner un maximum de temps au Marteau.<\/p>",
                "editor": null,
                "last_editor": "U0DTHMU81",
                "non_owner_editable": false,
                "updated": 1572008491,
                "is_starred": false,
                "has_rich_preview": false,
                "file_access": "visible"
            }
        ],
        "upload": false,
        "user": "U0DTHMU81",
        "display_as_bot": false,
        "ts": "1572008518.001100",
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "rzAbX",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "text",
                                "text": "2° partie avec une équipe de 2."
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "client_msg_id": "4eda5065-628c-49dc-ac8d-44ca741e63f4",
        "type": "message",
        "text": "Les groupes restant sont :\n- Conseil (3-5 individus)\n- Troupe (5-8 individus)\n- Horde (multitude de minion)\n- Commandant (Mono\/Duo + Troupe ou Horde)\n- Gauntlet (Enchaînement de combats sans interruption avec l'obligation d'avancer)",
        "user": "U0DTHMU81",
        "ts": "1572008857.004300",
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "zsy1c",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "text",
                                "text": "Les groupes restant sont :\n- Conseil (3-5 individus)\n- Troupe (5-8 individus)\n- Horde (multitude de minion)\n- Commandant (Mono\/Duo + Troupe ou Horde)\n- Gauntlet (Enchaînement de combats sans interruption avec l'obligation d'avancer)"
                            }
                        ]
                    }
                ]
            }
        ],
        "team": "T0A48J0MV",
        "user_team": "T0A48J0MV",
        "source_team": "T0A48J0MV",
        "user_profile": {
            "avatar_hash": "gf93bee477dc",
            "image_72": "https:\/\/secure.gravatar.com\/avatar\/2f93bee477dc9401eeca351b86195938.jpg?s=72&d=https%3A%2F%2Fa.slack-edge.com%2Fdf10d%2Fimg%2Favatars%2Fava_0016-72.png",
            "first_name": "",
            "real_name": "sharah",
            "display_name": "",
            "team": "T0A48J0MV",
            "name": "sharah",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "edited": {
            "user": "U0DTHMU81",
            "ts": "1572008864.000000"
        }
    },
    {
        "client_msg_id": "59ca08e0-ff50-428e-8648-589b513f6a5a",
        "type": "message",
        "text": "Intéressant, mais a quoi ça sert ? Quel usage nous en proposes-tu ? C'est pour de l'analyse de combat ? ou de la création de rencontre ? ou autre ?",
        "user": "U0A48EDPD",
        "ts": "1572033677.001400",
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "jR=t0",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "text",
                                "text": "Intéressant, mais a quoi ça sert ? Quel usage nous en proposes-tu ? C'est pour de l'analyse de combat ? ou de la création de rencontre ? ou autre ?"
                            }
                        ]
                    }
                ]
            }
        ],
        "team": "T0A48J0MV",
        "user_team": "T0A48J0MV",
        "source_team": "T0A48J0MV",
        "user_profile": {
            "avatar_hash": "0afdabdefe98",
            "image_72": "https:\/\/avatars.slack-edge.com\/2017-05-06\/179039830384_0afdabdefe98471fc0ae_72.png",
            "first_name": "",
            "real_name": "faby",
            "display_name": "",
            "team": "T0A48J0MV",
            "name": "faby",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "thread_ts": "1572033677.001400",
        "reply_count": 3,
        "reply_users_count": 1,
        "latest_reply": "1572201308.000500",
        "reply_users": [
            "U0DTHMU81"
        ],
        "replies": [
            {
                "user": "U0DTHMU81",
                "ts": "1572201111.000100"
            },
            {
                "user": "U0DTHMU81",
                "ts": "1572201264.000300"
            },
            {
                "user": "U0DTHMU81",
                "ts": "1572201308.000500"
            }
        ],
        "is_locked": false,
        "subscribed": true,
        "last_read": "1572201574.001400"
    },
    {
        "client_msg_id": "4befdde7-d360-4a25-8adc-80d6200444e5",
        "type": "message",
        "text": "En tout cas, dans ce que tu proposes :\n- Le Marteau est indispensable\n- Un Marteau est efficace en Mainteneur",
        "user": "U0A48EDPD",
        "ts": "1572033746.002200",
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "umM",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "text",
                                "text": "En tout cas, dans ce que tu proposes :\n- Le Marteau est indispensable\n- Un Marteau est efficace en Mainteneur"
                            }
                        ]
                    }
                ]
            }
        ],
        "team": "T0A48J0MV",
        "user_team": "T0A48J0MV",
        "source_team": "T0A48J0MV",
        "user_profile": {
            "avatar_hash": "0afdabdefe98",
            "image_72": "https:\/\/avatars.slack-edge.com\/2017-05-06\/179039830384_0afdabdefe98471fc0ae_72.png",
            "first_name": "",
            "real_name": "faby",
            "display_name": "",
            "team": "T0A48J0MV",
            "name": "faby",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "thread_ts": "1572033746.002200",
        "reply_count": 3,
        "reply_users_count": 1,
        "latest_reply": "1572201440.001100",
        "reply_users": [
            "U0DTHMU81"
        ],
        "replies": [
            {
                "user": "U0DTHMU81",
                "ts": "1572201365.000700"
            },
            {
                "user": "U0DTHMU81",
                "ts": "1572201407.000900"
            },
            {
                "user": "U0DTHMU81",
                "ts": "1572201440.001100"
            }
        ],
        "is_locked": false,
        "subscribed": true,
        "last_read": "1572201574.001400"
    },
    {
        "client_msg_id": "f9ab4050-f92d-4403-9702-e5189962ee24",
        "type": "message",
        "text": "Sinon, les Duo sont assez bien construits, et les réponses  mes questions se dont trouvées dans les docs précédents.",
        "user": "U0A48EDPD",
        "ts": "1572033969.003300",
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "aOtPA",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "text",
                                "text": "Sinon, les Duo sont assez bien construits, et les réponses  mes questions se dont trouvées dans les docs précédents."
                            }
                        ]
                    }
                ]
            }
        ],
        "team": "T0A48J0MV",
        "user_team": "T0A48J0MV",
        "source_team": "T0A48J0MV",
        "user_profile": {
            "avatar_hash": "0afdabdefe98",
            "image_72": "https:\/\/avatars.slack-edge.com\/2017-05-06\/179039830384_0afdabdefe98471fc0ae_72.png",
            "first_name": "",
            "real_name": "faby",
            "display_name": "",
            "team": "T0A48J0MV",
            "name": "faby",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "thread_ts": "1572033969.003300",
        "reply_count": 1,
        "reply_users_count": 1,
        "latest_reply": "1572201574.001400",
        "reply_users": [
            "U0DTHMU81"
        ],
        "replies": [
            {
                "user": "U0DTHMU81",
                "ts": "1572201574.001400"
            }
        ],
        "is_locked": false,
        "subscribed": true,
        "last_read": "1572201574.001400"
    }
]